antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
  adc_oneshot_unit_handle_t unit;
  adc_oneshot_unit_init_cfg_t ucfg = {};
  ucfg.unit_id = ADC_UNIT_1;
  if (adc_oneshot_new_unit(&ucfg, &unit) != ESP_OK)
  {
    LOGI("ERROR: ADC unit init failed");
    return adc_fail_mv;
  }
  adc_oneshot_chan_cfg_t ccfg = {};
  ccfg.atten = ADC_ATTEN_DB_12;
  ccfg.bitwidth = ADC_BITWIDTH_DEFAULT;
  adc_oneshot_config_channel(unit, ADC_CHANNEL_6, &ccfg);

  adc_cali_handle_t cali = nullptr;
  adc_cali_line_fitting_config_t lcfg = {};
  lcfg.unit_id = ADC_UNIT_1;
  lcfg.atten = ADC_ATTEN_DB_12;
  lcfg.bitwidth = ADC_BITWIDTH_DEFAULT;
  adc_cali_create_scheme_line_fitting(&lcfg, &cali);

  int raw = 0, mv = 0;
  bool read_ok = (adc_oneshot_read(unit, ADC_CHANNEL_6, &raw) == ESP_OK);
  if (cali)
  {
    adc_cali_raw_to_voltage(cali, raw, &mv);
    adc_cali_delete_scheme_line_fitting(cali);
  }
  else
  {
    mv = raw * 3100 / 4095; // uncalibrated fallback, 12dB full scale ~3.1V
  }
  adc_oneshot_del_unit(unit);

  if (!read_ok)
  {
    LOGI("ERROR: ADC read failed");
    return adc_fail_mv;
  }

  uint32_t battery_mv = (uint32_t)mv * 2;
  LOGI("Battery level: %d mV", (int)battery_mv);
  return battery_mv;
#elif defined(THERMOMETER_C6_BOARD)
  // Custom thermometer-c6 board: high-side switched 100k/100k divider
  // (R20/R21). VDIV_EN (GPIO3) high → Q5 NFET → Q4 P-FET connects VBAT;
  // the external 100k pull-down keeps it hard-off in deep sleep. C29 10nF
  // reservoir on the ADC node charges through 100k — give it a few ms.
  // VBAT_ADC = GPIO2 = ADC1_CH2. While VBUS is present this node reads the
  // charger CV output, not battery SoC — see vbus_present().
  // ADC-failure fallback sits between no_battery_mv and low_battery_mv:
  // visible as a warning, can never trigger permanent shutdown.
  const uint32_t adc_fail_mv = 3750;

  gpio_out_init(3 /* VDIV_EN */);
  gpio_set_level(GPIO_NUM_3, 1);
  sleep_ms(5);

  adc_oneshot_unit_handle_t unit;
  adc_oneshot_unit_init_cfg_t ucfg = {};
  ucfg.unit_id = ADC_UNIT_1;
  if (adc_oneshot_new_unit(&ucfg, &unit) != ESP_OK)
  {
    gpio_set_level(GPIO_NUM_3, 0);
    LOGI("ERROR: ADC unit init failed");
    return adc_fail_mv;
  }
  adc_oneshot_chan_cfg_t ccfg = {};
  ccfg.atten = ADC_ATTEN_DB_12;
  ccfg.bitwidth = ADC_BITWIDTH_DEFAULT;
  adc_oneshot_config_channel(unit, ADC_CHANNEL_2, &ccfg);

  adc_cali_handle_t cali = nullptr;
  adc_cali_curve_fitting_config_t cfcfg = {};
  cfcfg.unit_id = ADC_UNIT_1;
  cfcfg.chan = ADC_CHANNEL_2;
  cfcfg.atten = ADC_ATTEN_DB_12;
  cfcfg.bitwidth = ADC_BITWIDTH_DEFAULT;
  adc_cali_create_scheme_curve_fitting(&cfcfg, &cali);

  int raw = 0, mv = 0;
  bool read_ok = (adc_oneshot_read(unit, ADC_CHANNEL_2, &raw) == ESP_OK);
  if (cali)
  {
    adc_cali_raw_to_voltage(cali, raw, &mv);
    adc_cali_delete_scheme_curve_fitting(cali);
  }
  else
  {
    mv = raw * 3300 / 4095; // uncalibrated fallback, 12dB full scale ~3.3V
  }
  adc_oneshot_del_unit(unit);
  gpio_set_level(GPIO_NUM_3, 0); // divider off; external pull-down holds it in sleep

  if (!read_ok)
  {
    LOGI("ERROR: ADC read failed");
    return adc_fail_mv;
  }

  uint32_t battery_mv = (uint32_t)mv * 2;
  LOGI("Battery level: %d mV", (int)battery_mv);
  return battery_mv;
#elif defined(ARDUINO_XIAO_ESP32C6)
  // https://wiki.seeedstudio.com/xiao_esp32c6_getting_started/#reading-battery-voltage
  // Requires wiring A0/GPIO0 to VBAT see https://wiki.seeedstudio.com/XIAO_ESP32C3_Getting_Started/#check-the-battery-voltage
  return 4321; // TODO: remove this once proper circuit has been soldered
#else
  #error "Unknown board type"
#endif
}

// USB presence. With VBUS attached, VBAT_ADC reads the charger CV node, so
// SoC-based decisions (especially permanent shutdown) must be suppressed.
bool vbus_present()
{
#if defined(THERMOMETER_C6_BOARD)
  // R22/R23 100k/100k from VBUS → ~2.5V at GPIO4 with USB attached; the
  // divider is dead (0V, zero drain) with USB unplugged.
  gpio_config_t cfg = {};
  cfg.pin_bit_mask = 1ULL << 4;
  cfg.mode = GPIO_MODE_INPUT;
  cfg.pull_up_en = GPIO_PULLUP_DISABLE;
  cfg.pull_down_en = GPIO_PULLDOWN_DISABLE;
  gpio_config(&cfg);
  return gpio_get_level(GPIO_NUM_4) != 0;
#else
  return false;
#endif
}

#ifndef DISABLE_LEDS
#if defined(ARDUINO_DFROBOT_FIREBEETLE_2_ESP32E)
  #include "Adafruit_NeoPixel.h"
  Adafruit_NeoPixel status_led(1, 5 /*data pin*/, NEO_GRB + NEO_KHZ800);
#elif defined(ARDUINO_XIAO_ESP32C6)
  #define STATUS_LED_PIN 15 // GPIO 15 (LED_BUILTIN), yellow, active-high
#else
  #error "Unknown board type"
#endif
#endif

static uint32_t rgb(uint8_t r, uint8_t g, uint8_t b)
{
  return ((uint32_t)r << 16) | ((uint32_t)g << 8) | b;
}

void initialize_status_led()
{
#ifndef DISABLE_LEDS
#if defined(ARDUINO_DFROBOT_FIREBEETLE_2_ESP32E)
  status_led.begin();
  status_led.setBrightness(128);
#elif defined(ARDUINO_XIAO_ESP32C6)
  gpio_out_init(STATUS_LED_PIN);
  gpio_set_level((gpio_num_t)STATUS_LED_PIN, 0);
#else
  #error "Unknown board type"
#endif
#endif
}

void set_status_led(uint32_t color)
{
#ifndef DISABLE_LEDS
#if defined(ARDUINO_DFROBOT_FIREBEETLE_2_ESP32E)
  // Looks like Red is a greenish tint
  // Green and Blue both show up correct
  status_led.setPixelColor(0, color);
  status_led.show();
#elif defined(ARDUINO_XIAO_ESP32C6)
  // Single-color yellow LED
  gpio_set_level((gpio_num_t)STATUS_LED_PIN, color != 0 ? 1 : 0);
#else
  #error "Unknown board type"
#endif
#endif
}

void clear_status_led()
{
#ifndef DISABLE_LEDS
#if defined(ARDUINO_DFROBOT_FIREBEETLE_2_ESP32E)
  status_led.clear();
  status_led.show();
#elif defined(ARDUINO_XIAO_ESP32C6)
  gpio_set_level((gpio_num_t)STATUS_LED_PIN, 0);
#else
  #error "Unknown board type"
#endif
#endif
}

float read_temperature()
{
  LOGI("Getting temperature");
  float temp = sensor.GetTemperatureC();
  LOGI("temp: %f °C", temp);
  return temp;
}

uint16_t buttonRead(uint8_t pin)
{
  gpio_config_t cfg = {};
  cfg.pin_bit_mask = 1ULL << pin;
  cfg.mode = GPIO_MODE_INPUT;
  cfg.pull_up_en = GPIO_PULLUP_ENABLE;
  gpio_config(&cfg);
  return gpio_get_level((gpio_num_t)pin); // return 0 when pressed
}

#if defined(ARDUINO_DFROBOT_FIREBEETLE_2_ESP32E)
#define SHUTDOWN_BUTTON_PIN 27
#elif defined(ARDUINO_XIAO_ESP32C6)
#define SHUTDOWN_BUTTON_PIN 9
#else
  #error "Unknown board type"
#endif

