antoinecellerier/firebeetle-esp32-e-thermometer/src/Thermometer.cpp
void handle_permanent_shutdown(uint32_t battery_mv)
{
  uint16_t pin27 = buttonRead(SHUTDOWN_BUTTON_PIN);
  LOGI("Button read %d: %d", SHUTDOWN_BUTTON_PIN, pin27);
  // On USB power the measured voltage is the charger CV node, not battery
  // SoC — never let it trigger the permanent shutdown while charging.
  if (pin27 == 0 || (battery_mv < no_battery_mv && !vbus_present()))
  {
    // If button is pressed or battery is dead, powerdown
    if (pin27 == 0)
    {
      // Looks like we might be getting extremely rare spurious reads of 0
      // Double check after a delay ...
      sleep_ms(1000);
      pin27 = buttonRead(SHUTDOWN_BUTTON_PIN);
      LOGI("Button read %d confirmation: %d", SHUTDOWN_BUTTON_PIN, pin27);
      if (pin27 != 0)
      {
        bad_pin27_count++;
        return;
      }

      display_clear();

      // ... and add somethign on screen for diagnostics purposes in case the delay isn't sufficient
      // TODO remove this later
      display_show_pin27_diagnostic(boot_count);
    }
    else //  battery_mv < no_battery_mv
    {
      time_t now;
      struct tm nowtm;
      get_time(&now, &nowtm);
      display_show_empty_battery(battery_mv, now, make_display_stats());
    }

    // This path bypasses start_deep_sleep(), so flush explicitly — it is the
    // one moment the archive most needs to be current, since the device is
    // about to be off indefinitely. Hourly entries were journaled as they were
    // finalized and are already safe; what would otherwise be lost is the base
    // snapshot, and with it the sparkline and the drift block.
    history_store_persist_now();

    for (int domain = 0; domain < ESP_PD_DOMAIN_MAX; domain++)
      esp_sleep_pd_config((esp_sleep_pd_domain_t)domain, ESP_PD_OPTION_OFF);
    LOGI("Shutting down until reset. All sleep pd domains have been shutdown.");
    esp_deep_sleep_start();
  }
}

void on_first_boot()
{
#ifdef DISABLE_WIFI
  LOGI("WiFi has been disabled at build time with DISABLE_WIFI. See local-secrets.h to fix.");
  // Not an error — suppress "! NO WIFI" indicator on display
  wifi_ok = true;
  set_status_led(rgb(255, 255, 0));
  sleep_ms(100);
#else
  #if !(defined(MY_WIFI_SSID) && defined(MY_WIFI_PASSWORD))
    #error "MY_WIFI_SSID and/or MY_WIFI_PASSWORD are not defined. See local-secrets.h to fix."
  #endif
  if (*MY_WIFI_SSID == 0)
  {
    LOGI("Missing WiFi SSID. Will assume network connectivity isn't possible. See local-secrets.h to fix.");
    return;
  }

  // Connect to WiFi with timeout (avoids hanging forever if network is down)
  LOGI("Connecting to WiFi and synchronizing time");
  set_status_led(rgb(0, 0, 255));

  // Retries inside one session, and handles its own WiFi teardown. Getting the
  // clock on the first boot matters more than it used to: without one the
  // device records no history at all, and a failure here used to be permanent.
  const bool synced = ntp_bootstrap_sync(NTP_BOOTSTRAP_ASSOC_TRIES);
  if (!synced)
    resync_fail_count++;   // wifi_ok separately reflects the association
  set_status_led(synced ? rgb(0, 255, 0) : rgb(255, 0, 0));

  // Judge the clock on its own merits either way. A failed sync does not mean
  // there is no time: a panic or WDT reset reloads .rtc.data — so boot_count is
  // back to 1 and this runs again — while the RTC timer keeps counting
  // correctly across it. Returning early instead left first_boot_time at 0,
  // which renders as a ~20601d uptime, hides the boot date, shows a permanent
  // NO-NTP badge against a correct clock, and keeps maybe_ntp_resync() on the
  // WiFi-burning bootstrap path indefinitely.
  time(&first_boot_time);
  ntp_synced = time_is_plausible(first_boot_time);
  if (ntp_synced && last_sync_time == 0)
    last_sync_time = first_boot_time;   // a value restored from flash wins
  if (!synced)
    LOGI("NTP sync failed — %s", ntp_synced
             ? "RTC clock is still plausible, keeping it"
             : "time is unreliable, will retry on later wakes");
#endif
}


bool periodic_display_clear(const time_t now, struct tm nowtm)
{
  // Trigger screen clear daily
  if (next_clear_time == 0)
  {
    if (now < one_day)
    {
      // We don't seem to have a synchronized clock, clear screen periodically from first boot
      next_clear_time = now + one_day;
    }
    else
    {
      // We have a synchronzied clock, clear screen periodically when it's likely to be least disruptive
      // Let's pick the next time it's 04h00
      time_t offset = 0;
      if (4 <= nowtm.tm_hour)
      {
        offset = one_day;
      }
      nowtm.tm_hour = 4;
      nowtm.tm_min = 0;
      nowtm.tm_sec = 0;
      next_clear_time = mktime(&nowtm) + offset;
    }
  }

  if (now < next_clear_time)
  {
    return false;
  }

  display_clear();
  next_clear_time += one_day; // Schedule next clear in a day
  return true;
}

void refresh_and_sleep(uint32_t battery_mv, float temp)
{
  time_t now;
  struct tm nowtm;
  get_time(&now, &nowtm);

#ifndef DISABLE_WIFI
  crash_log.stage = STAGE_NTP;
  maybe_ntp_resync(now);
  // Re-read time after potential resync correction
  get_time(&now, &nowtm);
#endif
  crash_log.cur_time = (uint32_t)now;

  update_temp_extremes(temp);
  update_hourly_history(now, &nowtm, temp);

  LOGI("now: %ld. next clear time: %ld. first boot time: %ld. prev_temp: %.1f",
       (long)now, (long)next_clear_time, (long)first_boot_time, previous_temp);
#ifdef MOCK_DISPLAY_DATA
  // Override sensor reading to match mock data range so it doesn't
  // distort the chart Y-axis (DummySensor returns a constant 12.3°C)
  temp = 22.3f;
#endif
  // RENDER covers both the periodic clear and the refresh below — either can
  // die mid-EPD-write (SPI, busy-wait light sleep, panel power)
  crash_log.stage = STAGE_RENDER;

#ifdef CRASH_TEST_BOOT
  // Deliberate crash to exercise the forensics path on hardware — flash with
  //   PLATFORMIO_BUILD_FLAGS="-DCRASH_TEST_BOOT=3" pio run -e <env> -t upload
  // (add -DCRASH_TEST_HANG to test the task-WDT→panic path instead of a null
  // deref). Fires on the first wake at/after that boot count, once per RTC
  // power cycle: the crash_count guard stops a crash loop, and also means a
  // second test needs a power cycle (which clears the CrashLog) first.
  if (boot_count >= CRASH_TEST_BOOT && crash_log.crash_count == 0)
  {
    LOGI("CRASH_TEST_BOOT: deliberately crashing at boot %d", boot_count);
    fflush(stdout);
#ifdef CRASH_TEST_HANG
    while (true) {}                    // starve idle task → TWDT → panic
#else
    *(volatile uint32_t *)0 = 0xdead;  // store to NULL → panic + coredump
#endif
  }
#endif
  bool should_refresh = periodic_display_clear(now, nowtm) ||
                         fabsf(temp - previous_temp) >= DISPLAY_TEMP_DELTA;
  if (!should_refresh)
  {
    LOGI("temperature hasn't changed significantly, no need to refresh display");
  }
  else
  {
    display_refresh_count++;
    if (max_battery_mv < battery_mv)
      max_battery_mv = battery_mv;

    // Same plausibility gate as update_hourly_history(): a 1970 timestamp here
    // would sit ~54 years before every stored point and never leave the window.
    // Not journaled — the sparkline rides along in the base snapshot instead.
    if (time_is_plausible(now))
      temp_history_record(historical_data.temp, &historical_data.temp_count,
                          now, (int16_t)(temp * 10));

    PPK2_DISPLAY_HIGH();
    display_show_temperature(temp, battery_mv, battery_mv < low_battery_mv,
                             now, &nowtm, make_display_stats());
    PPK2_DISPLAY_LOW();

    previous_temp = temp;
    previous_boot_count = boot_count;
  }

  // Only (re)load the LP/ULP program on a fresh boot. On deep-sleep wakes
  // the LP core is still running with its existing configuration — reloading
  // the binary would wipe its counters and is not needed. Must test the
  // CACHED cause: by this point the EPD light sleeps have overwritten the
  // live one, and querying it here re-inited the LP core on every refresh.
  if (sensor.SupportsUlp()
      && s_wake_cause == ESP_SLEEP_WAKEUP_UNDEFINED)
  {
    crash_log.stage = STAGE_LP_INIT;
    ulp_reinit_count++;
    sensor.InitializeUlp();
  }

  start_deep_sleep();
}


// Reset history buffers (sparkline + hourly).
// Called when the history data format changes (struct layout, buffer sizes).
static void reset_rtc_history()
{
  memset(&historical_data, 0, sizeof(historical_data));
  historical_data.current_hour_min_x10 = TEMP_INIT_MIN_X10;
  historical_data.current_hour_max_x10 = TEMP_INIT_MAX_X10;
  historical_data.version = RTC_HISTORY_VERSION;
  historical_data.self_addr = (uint32_t)&historical_data;
}

// Reset operational state (counters, flags, thresholds).
// Called when non-history RTC variables change. Preserves history.
static void reset_rtc_state()
{
  boot_count = 0;
  display_refresh_count = 0;
  ulp_reinit_count = 0;
  first_boot_time = 0;
  next_clear_time = 0;
  previous_temp = TEMP_NO_PREVIOUS;
  previous_boot_count = -1;
  max_battery_mv = 0;
  bad_pin27_count = 0;
  min_temp_since_boot = TEMP_INIT_MIN;
  max_temp_since_boot = TEMP_INIT_MAX;
  next_resync_time = 0;
  resync_interval_s = RESYNC_INTERVAL_MIN;
  last_drift_ms = 0;
  last_drift_window_s = 0;
  last_sync_time = 0;
  resync_fail_count = 0;
  memset(drift_ppm_hist, 0, sizeof(drift_ppm_hist));
  memset(drift_win_min, 0, sizeof(drift_win_min));
  drift_ppm_count = 0;
  wifi_ok = false;
  ntp_synced = false;
  last_sensor_ok = true;
  rtc_state_version = RTC_STATE_VERSION;
}

// Pull the history and drift block back out of the flash archive.
//
// Deliberately NOT gated on a plausible clock. A first-boot NTP failure is
// permanent today (on_first_boot() runs only at boot_count==1, and
// maybe_ntp_resync() returns early while !ntp_synced), and it is common on the
// XIAO boards — so waiting for a good clock would often mean never restoring at
// all, leaving 30 days of readable history invisible. The snapshot is
// internally consistent on its own; the clock is only needed to place *new*
// readings against it, which update_hourly_history() already refuses to do
// without one.
//
// current_hour_start is left at 0 (reset_rtc_history() zeroed it), which is the
// existing "first reading after boot" sentinel: no finalize can fire until a
// reading with a real clock arrives, and the gap between the snapshot and now
// is then filled with HOURLY_NO_DATA by the normal path.
static void restore_history_from_flash()
{
  HistoryDriftState drift;
  if (!history_store_restore(&historical_data, &drift))
  {
    reset_rtc_history();  // partial reads may have touched it
    return;
  }
  historical_data.self_addr = (uint32_t)&historical_data;
  historical_data.current_hour_start = 0;
  historical_data.current_hour_sum_x10 = 0;
  historical_data.current_hour_sample_count = 0;
  historical_data.current_hour_min_x10 = TEMP_INIT_MIN_X10;
  historical_data.current_hour_max_x10 = TEMP_INIT_MAX_X10;

  time_t now;
  time(&now);
  drift_state_load(&drift, time_is_plausible(now) &&
                               now >= (time_t)drift.last_sync_time);
}

// Same, for the branch where RTC history survived but the state block was
// reset. The archive's copy is at least as fresh as the one just cleared.
static void restore_drift_from_flash()
{
  HistoryDriftState drift;
  if (!history_store_restore(nullptr, &drift))
    return;
  time_t now;
  time(&now);
  drift_state_load(&drift, time_is_plausible(now) &&
                               now >= (time_t)drift.last_sync_time);
}

#ifdef PPK2_DEBUG
// Boot-time marker self-test, so PPK2 wiring can be confirmed before any
// measurement is trusted. Emits countable, distinct patterns — 5 pulses on the
// CPU-active channel, then 10 on the display/flash channel — and reads the pads
// back, which separates "the firmware isn't driving the pin" from "the lead is
// on the wrong pin". A flat channel with a passing read-back is a wiring fault.
static void ppk2_selftest()
{
  // INPUT_OUTPUT, not OUTPUT: gpio_config() with GPIO_MODE_OUTPUT disables the
  // input buffer on ESP32, so gpio_get_level() would always read 0.
  gpio_config_t cfg = {};
  cfg.pin_bit_mask = (1ULL << PPK2_PIN_CPU_ACTIVE) | (1ULL << PPK2_PIN_DISPLAY);
  cfg.mode = GPIO_MODE_INPUT_OUTPUT;
  gpio_config(&cfg);

  gpio_set_level((gpio_num_t)PPK2_PIN_CPU_ACTIVE, 1);
  gpio_set_level((gpio_num_t)PPK2_PIN_DISPLAY, 1);
  int d0_hi = gpio_get_level((gpio_num_t)PPK2_PIN_CPU_ACTIVE);
  int d1_hi = gpio_get_level((gpio_num_t)PPK2_PIN_DISPLAY);
  gpio_set_level((gpio_num_t)PPK2_PIN_CPU_ACTIVE, 0);
  gpio_set_level((gpio_num_t)PPK2_PIN_DISPLAY, 0);
  int d0_lo = gpio_get_level((gpio_num_t)PPK2_PIN_CPU_ACTIVE);
  int d1_lo = gpio_get_level((gpio_num_t)PPK2_PIN_DISPLAY);
  LOGI("PPK2 selftest: D0=GPIO%d %d->%d, D1=GPIO%d %d->%d — pads %s",
       PPK2_PIN_CPU_ACTIVE, d0_hi, d0_lo, PPK2_PIN_DISPLAY, d1_hi, d1_lo,
       (d0_hi && !d0_lo && d1_hi && !d1_lo) ? "follow (firmware OK)"
                                            : "DO NOT follow (firmware fault)");

  for (int i = 0; i < 5; i++)   // D0: 5 x 20ms
  {
    gpio_set_level((gpio_num_t)PPK2_PIN_CPU_ACTIVE, 1); sleep_ms(20);
    gpio_set_level((gpio_num_t)PPK2_PIN_CPU_ACTIVE, 0); sleep_ms(20);
  }
  for (int i = 0; i < 10; i++)  // D1: 10 x 10ms
  {
    gpio_set_level((gpio_num_t)PPK2_PIN_DISPLAY, 1); sleep_ms(10);
    gpio_set_level((gpio_num_t)PPK2_PIN_DISPLAY, 0); sleep_ms(10);
  }
}
#endif

void setup()
{
  // Must run before anything that can light-sleep (see s_wake_cause).
  s_wake_causes_raw = app_wakeup_causes_raw();
  s_wake_cause = app_wakeup_cause();

